# MultiLeader Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..MultiLeader Property
IndependentTag Class See Also
---
Returns if the tag if referencing multiple elements and/or sub-elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool MultiLeader { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MultiLeader As Boolean
	Get
```

Visual C++
---
```text
public:
property bool MultiLeader {
	bool get ();
}
```

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace